package main

import "fmt"

func main() {
 var a, b int
 fmt.Scan(&a, &b)
 for i:=1; i<=a/1000; i++ {
   /*if  (a/10000 == b/10000) || (a/10000 == (b%10000)/1000) || (a/10000 == (b%1000)/100) || (a/10000 == (b%100)/10) || (a/10000 == b%10) {
     fmt.Println(a/10000)
     fmt.Println("Метка 2")} else {break} */

  if (a/1000 == b/1000) || (a/1000 == (b%1000)/100) || (a/1000 == (b%100)/10) || (a/1000 == b%10) {
   fmt.Println(a / 1000)
   fmt.Println("Метка 2")} else {break}}
   //fmt.Println("Метка 3")
  } /*else if ((a%1000)/100 == b/1000) || ((a%1000)/100 == (b%1000)/100) || ((a%1000)/100 == (b%100)/10) || ((a%1000)/100 == b%10) {
   fmt.Println((a % 1000) / 100)
   //fmt.Println("Метка 4")
  } else if ((a%100)/10 == b/1000) || ((a%100)/10 == (b%1000)/100) || ((a%100)/10 == (b%100)/10) || ((a%100)/10 == b%10) {
   fmt.Println((a % 100) / 10)
   //fmt.Println("Метка 5")
  } else if (a%10 == b/1000) || (a%10 == (b%1000)/100) || (a%10 == (b%100)/10) || (a%10 == b%10) {
   fmt.Println(a % 10)*/

